      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Divisiones.
       AUTHOR. creacion_test_jean
       INSTALLATION. www.
       DATE-WRITTEN.20/12/2022
       DATE-COMPILED.20/12/2022
       REMARKS. Programa creado para ver las divisiones de cobol, y elementos extra.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM Divisiones.
